Repository: fernandorauda/imgapp-v2
Catalog: Sources/Resources/*.lproj/Localizable.strings
Languages: es

# navigation.images.title
source: Images
es: Imágenes

# image_list.empty.message
source: No images to display
es: No hay imágenes para mostrar

# image_list.loading
source: Loading...
es: Cargando...

# error.unexpected
source: An unexpected error occurred
es: Ocurrió un error inesperado

# error.no_internet
source: No internet connection. Check your connection and try again.
es: No hay conexión a internet. Verifica tu conexión e intenta de nuevo.

# error.timeout
source: The request took too long. Check your connection and try again.
es: La solicitud tardó demasiado. Verifica tu conexión e intenta de nuevo.

# error.unauthorized
source: Invalid credentials. Please check your API key.
es: Credenciales inválidas. Por favor, verifica tu API key.

# error.forbidden
source: You don't have permission to access this resource.
es: No tienes permiso para acceder a este recurso.

# error.not_found
source: The requested resource doesn't exist.
es: El recurso solicitado no existe.

# error.rate_limit
source: Too many requests. Please wait a moment and try again.
es: Demasiadas solicitudes. Espera un momento e intenta de nuevo.

# error.server
source: Server error. Please try again later.
es: Error en el servidor. Por favor, intenta más tarde.

# error.bad_request
source: Invalid request. Please try again.
es: La solicitud es inválida. Por favor, intenta de nuevo.

# error.decoding
source: Failed to process the server response.
es: Error al procesar la respuesta del servidor.

# error.cancelled
source: The request was cancelled.
es: La solicitud fue cancelada.

# error.network_generic
source: A network error occurred. Please try again.
es: Ocurrió un error de red. Por favor, intenta de nuevo.

# error.service_unavailable
source: The service is currently unavailable. Please try again later.
es: El servicio no está disponible en este momento. Intenta más tarde.

# error.no_images
source: No images found
es: No se encontraron imágenes

# action.retry
source: Retry
es: Reintentar

# action.cancel
source: Cancel
es: Cancelar

# image.no_description
source: No description
es: Sin descripción

# user.no_bio
source: No bio available
es: Sin biografía

# user.no_location
source: Location not available
es: Ubicación no disponible
